Revit 2027 API
PropertyLine.IsValidToConvert Method
 Check whether the sketch contains all valid supported curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidToConvert()
Public Function IsValidToConvert As Boolean
public:
bool IsValidToConvert()
member IsValidToConvert : unit -> bool
Return Value
Boolean
 True if the sketch only has line and arc, otherwise false.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace